yangfengwu45/learnHC32F460/例程/HC32F460Template/mcu/GCC/SVD/hc32f46x.svd
                <register>
                    <name>PODRB</name>
                    <description>desc PODRB</description>
                    <addressOffset>0x14</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>POUT00</name>
                            <description>desc POUT00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT01</name>
                            <description>desc POUT01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT02</name>
                            <description>desc POUT02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT03</name>
                            <description>desc POUT03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT04</name>
                            <description>desc POUT04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT05</name>
                            <description>desc POUT05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT06</name>
                            <description>desc POUT06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT07</name>
                            <description>desc POUT07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT08</name>
                            <description>desc POUT08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT09</name>
                            <description>desc POUT09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT10</name>
                            <description>desc POUT10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT11</name>
                            <description>desc POUT11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT12</name>
                            <description>desc POUT12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT13</name>
                            <description>desc POUT13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT14</name>
                            <description>desc POUT14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT15</name>
                            <description>desc POUT15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POERB</name>
                    <description>desc POERB</description>
                    <addressOffset>0x16</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>POUTE00</name>
                            <description>desc POUTE00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE01</name>
                            <description>desc POUTE01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE02</name>
                            <description>desc POUTE02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE03</name>
                            <description>desc POUTE03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE04</name>
                            <description>desc POUTE04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE05</name>
                            <description>desc POUTE05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE06</name>
                            <description>desc POUTE06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE07</name>
                            <description>desc POUTE07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE08</name>
                            <description>desc POUTE08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE09</name>
                            <description>desc POUTE09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE10</name>
                            <description>desc POUTE10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE11</name>
                            <description>desc POUTE11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE12</name>
                            <description>desc POUTE12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE13</name>
                            <description>desc POUTE13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE14</name>
                            <description>desc POUTE14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE15</name>
                            <description>desc POUTE15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POSRB</name>
                    <description>desc POSRB</description>
                    <addressOffset>0x18</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>POS00</name>
                            <description>desc POS00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS01</name>
                            <description>desc POS01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS02</name>
                            <description>desc POS02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS03</name>
                            <description>desc POS03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS04</name>
                            <description>desc POS04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS05</name>
                            <description>desc POS05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS06</name>
                            <description>desc POS06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS07</name>
                            <description>desc POS07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS08</name>
                            <description>desc POS08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS09</name>
                            <description>desc POS09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS10</name>
                            <description>desc POS10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS11</name>
                            <description>desc POS11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS12</name>
                            <description>desc POS12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS13</name>
                            <description>desc POS13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS14</name>
                            <description>desc POS14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS15</name>
                            <description>desc POS15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PORRB</name>
                    <description>desc PORRB</description>
                    <addressOffset>0x1A</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>POR00</name>
                            <description>desc POR00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR01</name>
                            <description>desc POR01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR02</name>
                            <description>desc POR02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR03</name>
                            <description>desc POR03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR04</name>
                            <description>desc POR04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR05</name>
                            <description>desc POR05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR06</name>
                            <description>desc POR06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR07</name>
                            <description>desc POR07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR08</name>
                            <description>desc POR08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR09</name>
                            <description>desc POR09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR10</name>
                            <description>desc POR10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR11</name>
                            <description>desc POR11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR12</name>
                            <description>desc POR12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR13</name>
                            <description>desc POR13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR14</name>
                            <description>desc POR14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR15</name>
                            <description>desc POR15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
