yangfengwu45/learnHC32F460/例程/HC32F460Template/mcu/GCC/SVD/hc32f46x.svd
                <register>
                    <name>OCMRWL</name>
                    <description>desc OCMRWL</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>OCFDCLWL</name>
                            <description>desc OCFDCLWL</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFPKLWL</name>
                            <description>desc OCFPKLWL</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFUCLWL</name>
                            <description>desc OCFUCLWL</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFZRLWL</name>
                            <description>desc OCFZRLWL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPDCLWL</name>
                            <description>desc OPDCLWL</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPPKLWL</name>
                            <description>desc OPPKLWL</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPUCLWL</name>
                            <description>desc OPUCLWL</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPZRLWL</name>
                            <description>desc OPZRLWL</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPNPKLWL</name>
                            <description>desc OPNPKLWL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPNZRLWL</name>
                            <description>desc OPNZRLWL</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPNDCLWL</name>
                            <description>desc EOPNDCLWL</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPNUCLWL</name>
                            <description>desc EOPNUCLWL</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPDCLWL</name>
                            <description>desc EOPDCLWL</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPPKLWL</name>
                            <description>desc EOPPKLWL</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPUCLWL</name>
                            <description>desc EOPUCLWL</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPZRLWL</name>
                            <description>desc EOPZRLWL</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPNPKLWL</name>
                            <description>desc EOPNPKLWL</description>
                            <msb>29</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPNZRLWL</name>
                            <description>desc EOPNZRLWL</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPSR</name>
                    <description>desc CPSR</description>
                    <addressOffset>0x42</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>CNTR</name>
                    <description>desc CNTR</description>
                    <addressOffset>0x46</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>CCSR</name>
                    <description>desc CCSR</description>
                    <addressOffset>0x48</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x40</resetValue>
                    <resetMask>0xE3FF</resetMask>
                    <fields>
                        <field>
                            <name>CKDIV</name>
                            <description>desc CKDIV</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLEAR</name>
                            <description>desc CLEAR</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>desc MODE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STOP</name>
                            <description>desc STOP</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUFEN</name>
                            <description>desc BUFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IRQPEN</name>
                            <description>desc IRQPEN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IRQPF</name>
                            <description>desc IRQPF</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IRQZEN</name>
                            <description>desc IRQZEN</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IRQZF</name>
                            <description>desc IRQZF</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECKEN</name>
                            <description>desc ECKEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CVPR</name>
                    <description>desc CVPR</description>
                    <addressOffset>0x4A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ZIM</name>
                            <description>desc ZIM</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIM</name>
                            <description>desc PIM</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ZIC</name>
                            <description>desc ZIC</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PIC</name>
                            <description>desc PIC</description>
                            <msb>15</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PFSRU</name>
                    <description>desc PFSRU</description>
                    <addressOffset>0x82</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDARU</name>
                    <description>desc PDARU</description>
                    <addressOffset>0x84</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDBRU</name>
                    <description>desc PDBRU</description>
                    <addressOffset>0x86</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PFSRV</name>
                    <description>desc PFSRV</description>
                    <addressOffset>0x8A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDARV</name>
                    <description>desc PDARV</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDBRV</name>
                    <description>desc PDBRV</description>
                    <addressOffset>0x8E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PFSRW</name>
                    <description>desc PFSRW</description>
                    <addressOffset>0x92</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDARW</name>
                    <description>desc PDARW</description>
                    <addressOffset>0x94</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDBRW</name>
                    <description>desc PDBRW</description>
                    <addressOffset>0x96</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>POCRU</name>
                    <description>desc POCRU</description>
                    <addressOffset>0x98</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DIVCKU</name>
                            <description>desc DIVCKU</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMMDU</name>
                            <description>desc PWMMDU</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LVLSU</name>
                            <description>desc LVLSU</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POCRV</name>
                    <description>desc POCRV</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DIVCKV</name>
                            <description>desc DIVCKV</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMMDV</name>
                            <description>desc PWMMDV</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LVLSV</name>
                            <description>desc LVLSV</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POCRW</name>
                    <description>desc POCRW</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DIVCKW</name>
                            <description>desc DIVCKW</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMMDW</name>
                            <description>desc PWMMDW</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LVLSW</name>
                            <description>desc LVLSW</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
